In [21]:
import seaborn as sns
import numpy as np
import pandas as pd

1 Load Dataset & Inspect it

In [22]:
df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [23]:
print("the column names of the dataset include:")
display(df.columns)
print("describing the dataset:")
display(df.describe())
print("the shape of the dataset is:")
display(df.shape)

the column names of the dataset include:

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

describing the dataset:

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

the shape of the dataset is:

(891, 15)

In [24]:
print("the missing values of the dataset include:")
display(df.isna().sum())

the missing values of the dataset include:

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

2 Preprocess data

2-1 Fill missing values

In [25]:
df["age"] = df["age"].fillna(
    df.groupby(["sex", "class"])["age"].transform("median")
)
#sanity check
print("after imputation, the missing values are now as follows:")
display(df["age"].isna().sum())

after imputation, the missing values are now as follows:

/var/folders/00/g6wzklhx6nj9649_f1shk6lc0000gp/T/ipykernel_11414/3315814253.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(["sex", "class"])["age"].transform("median")

np.int64(0)

In [26]:
df["embarked"] = df["embarked"].fillna(method="ffill")
#sanity check
print("the df with filled na values for the 'Embarked' column are:")
display(df["embarked"].isna().sum())

the df with filled na values for the 'Embarked' column are:

/var/folders/00/g6wzklhx6nj9649_f1shk6lc0000gp/T/ipykernel_11414/829128376.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["embarked"] = df["embarked"].fillna(method="ffill")

np.int64(0)

In [28]:
df = df.drop("deck", axis=1)

In [29]:
#sanity check
print("the shape of the df after dropping the desired column:",df.shape)
print("the columns of the df after dropping the desired column:",df.columns)

the shape of the df after dropping the desired column: (891, 14)
the columns of the df after dropping the desired column: Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [33]:
df['embark_town'] = df['embark_town'].fillna(method="ffill")
#sanity check
df["embark_town"].isna().sum()

/var/folders/00/g6wzklhx6nj9649_f1shk6lc0000gp/T/ipykernel_11414/3151159742.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['embark_town'] = df['embark_town'].fillna(method="ffill")

np.int64(0)

3 Save preprocessed data

In [35]:
from pathlib import Path

file_path = Path.cwd() / "data" / "titanic.csv"

if not file_path.parent.exists():
    file_path.parent.mkdir(parents=True, exist_ok=True)

print(file_path)

/Users/AnanyaPal1/Documents/data-engineering/notebooks/titanic/01_preprocessing/data/titanic.csv

In [36]:
df_filtered = df.to_csv(file_path)